junhuanchen/simplelink_cc13xx_cc26xx_sdk_7_10_01_24/examples/rtos/CC1352P1_LAUNCHXL/drivers/dacoutputbuffer/tirtos7/dacoutputbuffer.syscfg
/*
 * Copyright (c) 2021-2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/CC1352P1_LAUNCHXL --rtos tirtos7

/*
 *  dacoutputbuffer.syscfg
 */

/* ======== Kernel Configuration ======== */
system.getScript("kernel_config_release.syscfg.js");

/* ======== Board ======== */
var board = system.deviceData.board.name;

/* ======== DAC ======== */
var DAC     = scripting.addModule("/ti/drivers/DAC");
var DAC1    = DAC.addInstance();
var DAC2    = DAC.addInstance();
DAC1.$name  = "CONFIG_DAC_0";
DAC2.$name  = "CONFIG_DAC_1";

/* ======== ADC ======== */
var ADC     = scripting.addModule("/ti/drivers/ADC");
var ADC1    = ADC.addInstance();
ADC1.$name  = "CONFIG_ADC_0";

/* ======== TIMER ======== */
var Timer                  = scripting.addModule("/ti/drivers/Timer");
var Timer1                 = Timer.addInstance();
Timer1.$name               = "CONFIG_TIMER_0";
Timer1.useGPTimer          = true;
Timer1.timerInstance.$name = "CONFIG_GPTIMER_0";

/* ======== Display ======== */
var Display       = scripting.addModule("/ti/display/Display");
var display       = Display.addInstance();
display.$hardware = system.deviceData.board.components.XDS110UART;
